Cleanup and add documentation
